[
  {
    "text": "\"{\\\"name\\\":\\\"Spaces\\\",\\\"description\\\":\\\"Spaces are the broadest organizational unit of the platform. They consist of Groups, Channels, Threads, and Messages.\\\"} [{\\\"name\\\":\\\"CRT Wall\\\",\\\"description\\\":\\\"<p><span style=\\\\\\\"color: rgb(186, 186, 186);\\\\\\\">This space is dedicated to CRT video walls for artistic purposes. Specifically, we aim to provide resources, software development, and support to artists looking to create their own CRT video walls for live performances, installations, or music videos. Our goal is to make procuring, designing, building, and controlling CRT video walls as easy and accessible as possible.</span></p>\\\"},{\\\"name\\\":\\\"Harmony\\\",\\\"description\\\":\\\"<p>Harmony is a friendly hummingbird whose platform is organized into a hierarchy of spaces, groups, channels, threads, and messages. It’s a flexible system designed to brainstorm, research, communicate, and cowork. Importantly, and unlike say ChatGPT, it’s designed to be the place for your data and work, as it’s highly structured and persistent, and any of the content can be edited and organized easily. Harmony can recommend entire org structures for spaces, suggested groups, channels, threads or even messages to continue the conversation and process towards goals, all while building a compendium of structured information. These recommendations are made based on the context and goals of the corresponding channel etc.</p><p>Harmony can also interact via voice, and even highlights the words in the UI in sync with her speech.</p><ul><li><strong>Spaces: </strong>These are the broadest organizational units on the platform. They may represent different organizations, departments, or projects.</li><li><strong>Groups: </strong>Within spaces, you can create groups to segregate different parts of the space based on logical categories. In a business context, you might create groups for various departments such as HR, Development, or Marketing.</li><li><strong>Channels: </strong>Channels exist within groups and are the places where work gets done. Conversations take place and assets are created here. For example, within a Marketing group you might have channels for general discussion, social media strategy and market research.</li><li><strong>Threads: </strong>Channels feature threads which are focused conversations on specific subjects. This way dialogue within channels can stay organized and relevant.</li><li><strong>Messages: </strong>These are the individual units of communication sent by members of the channel or by personas.</li></ul><p>The purpose of this space is to strategize about the capabilities, goals, and promotion of the Harmony platform.</p>\\\"},{\\\"name\\\":\\\"AVsync.LIVE\\\",\\\"description\\\":\\\"<p>AVsync.LIVE is free software for creating audio reactive visuals for live performances. Our purpose is to make the medium of audio reactive visuals accessible to a new generation of artists. We believe live visuals are a drastically under populated and niche field of art, despite it being artistically and monetarily rewarding while strengthening and improving music communities. AVsync.LIVE was designed to be the go-to tool for all artists looking to get into this exciting medium without having to pay hundreds for special software. </p><p>The software is organized as follows:</p><ul><li>Playlists are sequences of Scenes</li><li>Scenes have Layers and Effects</li><li>Layers have Sources and Effects</li><li>There are dozens of built in Effects which can sync to music, optical flow, and be animated.</li><li>You can A/B mix between Scenes using Transitions.</li></ul><p>AVsync can be controlled by MIDI, Mouse, Keyboard, and Touchscreen in any combination. It has a web and desktop version. </p><p>The goal of this space is to strategize around product development, live performances in Chicago, promotion, and education through tutorials, possible also social media strategy.</p>\\\"},{\\\"name\\\":\\\"Fashion Quest\\\",\\\"description\\\":\\\"<p>The Underground Art Gallery Chicago (UAGC) is a creative hub and cultural institution, one part swanky clubhouse, one part subversive charity. As an organization, we have three objectives:</p><ul><li>to invest in artists, with an emphasis on local street artists</li><li>to encourage creative collaboration and interdisciplinary community building</li><li>to make fine art more accessible to the masses</li></ul><p>We invest in artists, creatives, host events, and give away fine art! We throw 2 or 3 art parties a year, including an annual art battle in September.</p><p>Our next event, the “Fashion Quest” is on Sat, May 18th, from 4pm – 4am.</p><p>I am in charge of the development of the website, uagc.fyi. The website needs to do the following:</p><ul><li>Accept RSVP requests before the party</li><li>Accept donations before and during the party (Stripe)</li><li>Create a Doorlist page accessible to security which includes a list of people who are allowed into the party. It is compiled from lists of RSVPs, VIPs, Performers, Personnel, and Members of the UAGC. There are 3 security positions: Gatekeeper, Lookout, and Innkeeper. The Gatekeeper admits people, giving them either a bunny stamp (guest allowed to drink) or key stamp (member, vip, performer, allowed to drink) depending on their status. They may be given no stamp if they are not a member. If they are wearing their UAGC-issued member key, then that acts the same as a key stamp and they don't need a stamp. The Gatekeeper can also check in guests, not just admit them.</li><li>Create a Barkeep page accessible to bartenders which shows a list of all of those who are allowed to drink, and their designation as guest who donated, or privileged status (member, vip, performer). Guests can scan a QR code which allows them to donate. The Barkeep can verify their donation and give them a bunny stamp.</li><li>Create an Innnkeeper page, which is accessed by the Innkeeper, security personnel who manages access to the third floor \\\\\\\"Parlor\\\\\\\" during the Fashion Show and Cabaret. The page lists all who are allowed to access. Those with a Fashion Pass are admitted entry to the Fashion Show 8-11pm. Those with a Parlor Pass are admitted entry to the Cabaret show 11pm-?. The Cabaret will have self serve alcohol. </li><li>The address of the UAGC needs to be sent out in a message 24 hours before to all those who RSVP'd (and we accepted). RSVPs have a status of either sent/declined/unsent This will be send out by either email or text.</li><li>We need to add a donation option to the RSVP page. The suggested donation is $12, including day-of to get access to the bar.</li></ul><p>For the Fashion Show, we will doing \\\\\\\"light bath\\\\\\\" projection, where the models are bathed in projected patterns. Show the past 3 years I have been the projectionist, but this year we are seeking a new artist to manage fill that role. We will need to source and figure out ideal placement of the projector.</p><p>In the garage \\\\\\\"Gift Shop\\\\\\\" there will be several music performances. I will be providing visuals to enhance the experience. I would like to either use a projector, stacks of CRT televisions, or perhaps both. We need to strategize about placement and visual content.</p><p>In the basement \\\\\\\"Gallery\\\\\\\" there will be DJs performing. We need to figure out visuals for this area as well.</p><p>The purpose of this space is to keep track of all my responsibilities and the features that uagc.fyi needs.</p>\\\"}]\"",
    "id_": "spaces",
    "metadata": {
      "name": "Spaces",
      "description": "Spaces are the broadest organizational unit of the platform. They consist of Groups, Channels, Threads, and Messages."
    }
  },
  {
    "text": "\"{\\\"name\\\":\\\"Groups in CRT Wall Space\\\",\\\"description\\\":\\\"The groups available for space CRT Wall, each with name and description.\\\"} [{\\\"name\\\":\\\"📺 Wall\\\",\\\"description\\\":\\\"CRT video wall projects.\\\"},{\\\"name\\\":\\\"🎨 Art\\\",\\\"description\\\":\\\"CRT video wall art and creativity.\\\"},{\\\"name\\\":\\\"💻 Tech\\\",\\\"description\\\":\\\"CRT video wall technical discussions.\\\"},{\\\"name\\\":\\\"🤝 Community\\\",\\\"description\\\":\\\"Connect with other CRT video wall artists.\\\"},{\\\"name\\\":\\\"📚 Resources\\\",\\\"description\\\":\\\"Gather and share CRT video wall resources.\\\"}]\"",
    "id_": "groups_in_CRT_Wall",
    "metadata": {
      "name": "Groups in CRT Wall Space",
      "description": "The groups available for space CRT Wall, each with name and description."
    }
  },
  {
    "text": "\"{\\\"name\\\":\\\"Groups in Harmony Space\\\",\\\"description\\\":\\\"The groups available for space Harmony, each with name and description.\\\"} [{\\\"name\\\":\\\"🏢 Organization\\\",\\\"description\\\":\\\"Structuring our space for productivity.\\\"},{\\\"name\\\":\\\"💻 Development\\\",\\\"description\\\":\\\"Building and refining Harmony's capabilities.\\\"},{\\\"name\\\":\\\"💬 Community\\\",\\\"description\\\":\\\"Connecting with users and gathering feedback.\\\"},{\\\"name\\\":\\\"📚 Learning\\\",\\\"description\\\":\\\"Refining our understanding of Harmony's capabilities.\\\"},{\\\"name\\\":\\\"❤️ Harmony's Persona\\\",\\\"description\\\":\\\"Developing the personality and lore of Harmony.\\\"}]\"",
    "id_": "groups_in_Harmony",
    "metadata": {
      "name": "Groups in Harmony Space",
      "description": "The groups available for space Harmony, each with name and description."
    }
  },
  {
    "text": "\"{\\\"name\\\":\\\"Groups in AVsync.LIVE Space\\\",\\\"description\\\":\\\"The groups available for space AVsync.LIVE, each with name and description.\\\"} [{\\\"name\\\":\\\"💻 Development\\\",\\\"description\\\":\\\"Product development and feature requests.\\\"},{\\\"name\\\":\\\"🎥 Live Performances\\\",\\\"description\\\":\\\"Organizing live performances in Chicago.\\\"},{\\\"name\\\":\\\"📢 Promotion\\\",\\\"description\\\":\\\"Promoting AVsync.LIVE and its community.\\\"},{\\\"name\\\":\\\"📚 Education\\\",\\\"description\\\":\\\"Creating tutorials and educational resources.\\\"},{\\\"name\\\":\\\"📊 Maintainer's Corner\\\",\\\"description\\\":\\\"A space for the maintainer to discuss and plan.\\\"}]\"",
    "id_": "groups_in_AVsync.LIVE",
    "metadata": {
      "name": "Groups in AVsync.LIVE Space",
      "description": "The groups available for space AVsync.LIVE, each with name and description."
    }
  },
  {
    "text": "\"{\\\"name\\\":\\\"Groups in Fashion Quest Space\\\",\\\"description\\\":\\\"The groups available for space Fashion Quest, each with name and description.\\\"} [{\\\"name\\\":\\\"🎉 Events\\\",\\\"description\\\":\\\"Organize and manage events.\\\"},{\\\"name\\\":\\\"🎨 Art\\\",\\\"description\\\":\\\"Support and promote local artists.\\\"},{\\\"name\\\":\\\"🌐 Website\\\",\\\"description\\\":\\\"Manage the development of the uagc.fyi website.\\\"},{\\\"name\\\":\\\"📩 Communication\\\",\\\"description\\\":\\\"Manage communication with event attendees.\\\"},{\\\"name\\\":\\\"📚 Documentation\\\",\\\"description\\\":\\\"Create and maintain documentation for uagc.fyi.\\\"}]\"",
    "id_": "groups_in_Fashion_Quest",
    "metadata": {
      "name": "Groups in Fashion Quest Space",
      "description": "The groups available for space Fashion Quest, each with name and description."
    }
  }
]